{
    "categories": [
        {
            "icon": "%E2%84%B9",
            "explanation": "General info on the API."
        },
        {
            "icon": "358298723035643905",
            "explanation": "All rules that are enforced here and on the forum."
        },
        {
            "icon": "%F0%9F%94%97",
            "explanation": "Dev portal links."
        },
        {
            "icon": "453058143694487554",
            "explanation": "Explanation of all HTTP error codes that the API returns."
        },
        {
            "icon": "%F0%9F%91%AA",
            "explanation": "Community efforts!"
        },
        {
            "icon": "358293780107100160",
            "explanation": "Le epic may-mays!"
        }
    ],
    "messages": [
        {
            "command": "400",
            "message": "__**400 (Bad Request)**__\nThis error indicates that there is a syntax error in the request and the request has therefore been denied. The client should not continue to make similar requests without modifying the syntax or the requests being made.\n\n**Common Reasons:**\nA provided parameter is in the wrong format (e.g., a string instead of an integer)\nA required parameter was not provided\n\nhttps://developer.riotgames.com/response-codes.html",
            "counter": 7,
            "categoryId": "429:453058143694487554"
        },
        {
            "command": "402",
            "message": "__**402 (Payment Required)**__\nThis error indicates that payment is required and the request has therefore been denied. The client should not continue to make similar requests without appropriate payment.",
            "counter": 3,
            "categoryId": "429:453058143694487554"
        },
        {
            "command": "403",
            "message": "__**403 (Forbidden)**__\nThis error indicates that the API request being made did not contain the necessary authentication credentials and therefore the client was denied access. If authentication credentials were already included then the Unauthorized response indicates that authorization has been refused for those credentials. In the case of the API, authorization credentials refer to your API key.\n\n**Common Reasons:**\nNo API key was provided with the API request\nAn invalid API key was provided with the API request\nA blacklisted API key was provided with the API request\nThe API request was for an incorrect or unsupported path\n\nhttps://developer.riotgames.com/response-codes.html",
            "counter": 13,
            "categoryId": "429:453058143694487554"
        },
        {
            "command": "404",
            "message": "__**404 (Not Found)**__\nThis error indicates that the server has not found a match for the API request being made. No indication is given whether the condition is temporary or permanent.\n\n**Common Reasons:**\nThe ID or name provided does not match any existing resource (e.g., there is no summoner matching the specified ID)\nThe API request was for an incorrect or unsupported path\n\nhttps://developer.riotgames.com/response-codes.html",
            "counter": 8,
            "categoryId": "429:453058143694487554"
        },
        {
            "command": "415",
            "message": "__**415 (Unsupported Media Type)**__\nThis error indicates that the server is refusing to service the request because the body of the request is in a format that is not supported.\n\n**Common Reasons:**\nThe `Content-Type` header was not appropriately set\n\nhttps://developer.riotgames.com/response-codes.html",
            "counter": 1,
            "categoryId": "429:453058143694487554"
        },
        {
            "command": "429",
            "message": "__**429 (Rate Limit Exceeded)**__\nThis error indicates that the application has exhausted its maximum number of allotted API calls allowed for a given duration. If the client receives a Rate Limit Exceeded response the client should process this response and halt future API calls for the duration, in seconds, indicated by the `Retry-After` header. **Applications that are in violation of this policy may have their access disabled to preserve the integrity of the API.** Please refer to our Rate Limiting documentation (https://developer.riotgames.com/rate-limiting.html) for more information on determining if you have been rate limited and how to avoid it.\n\n**Common Reasons:**\nUnregulated API calls. Check your API Call Graphs to monitor your Dev and Production API key activity.\n\nhttps://developer.riotgames.com/response-codes.html",
            "counter": 20,
            "categoryId": "429:453058143694487554"
        },
        {
            "command": "500",
            "message": "__**500 (Internal Server Error)**__\nThis error indicates an unexpected condition or exception which prevented the server from fulfilling an API request.\n\nhttps://developer.riotgames.com/response-codes.html",
            "counter": 5,
            "categoryId": "429:453058143694487554"
        },
        {
            "command": "503",
            "message": "__**503 (Service Unavailable)**__\nThis error indicates the server is currently unavailable to handle requests because of an unknown reason. The Service Unavailable response implies a temporary condition which will be alleviated after some delay.\n\nhttps://developer.riotgames.com/response-codes.html",
            "counter": 4,
            "categoryId": "429:453058143694487554"
        },
        {
            "command": "api-ref",
            "message": "https://developer.riotgames.com/api-methods/",
            "counter": 4,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "api-reference",
            "message": "https://developer.riotgames.com/api-methods/",
            "counter": 2,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "api-status-api",
            "message": "https://querijn.codes/api_status/",
            "counter": 3,
            "categoryId": "%F0%9F%91%AA"
        },
        {
            "command": "appid",
            "counter": 0,
            "message": "What is your app ID? You can find this by going to https://developer.riotgames.com/apps, selecting your project from the list on the left, and copying the number in the URL (https://developer.riotgames.com/app/YOUR_APP_ID_IS_HERE/info)",
            "categoryId": "%E2%84%B9"
        },
        {
            "command": "bad-bot",
            "message": "<:dab:395941227054497792>",
            "counter": 16,
            "categoryId": "kappa:358293780107100160"
        },
        {
            "command": "be-nice",
            "message": "Rule 1. Be respectful. No spamming, advertising, or NSFW content.",
            "categoryId": "TuxHammer:358298723035643905",
            "counter": 3
        },
        {
            "command": "botty-dev-server",
            "message": "https://discord.gg/zTJYKkA",
            "counter": 4,
            "categoryId": "%F0%9F%91%AA"
        },
        {
            "command": "cdragon",
            "counter": 15,
            "message": "cdragon is a community project aimed at fixing the errors in ddragon and providing assets from the game. Join the cdragon discord here https://discord.gg/yNFG5yk",
            "categoryId": "%F0%9F%91%AA"
        },
        {
            "command": "channel-help",
            "message": "#riot-api is a general chat for Riot Games API-based chat,\n#troubleshooting is for actual help and resoval around the API,\n#off-topic is a general chat for non Riot Games API-based chat.",
            "counter": 2,
            "categoryId": "%E2%84%B9"
        },
        {
            "command": "code-of-conduct",
            "message": "https://developer.riotgames.com/policies.html#codeofconduct",
            "counter": 2,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "custom-data",
            "message": "Currently, custom game data (excluding the tournament system), is not retrievable from the API due to privacy policies.\n\nA lot of these private things, like custom modes, champion mastery grade, etc that developers would like, are all things that one of the users in each game may not want to be publicly pull-able. Whereas, all users agree to it being pull-able in all other official games. While a normal game isn't try-hard like ranked, the user is still probably playing with the goal to win or compete in the game as intended. This may not always be the case in a custom mode.\n\nThe tournament system also takes into account a user's agreement, as the user is choosing to participate in an official game (the tournament system) and therefore giving some consent on data pulling for those specific games by using the tournament API.\n\nThe shining light to this, is that Riot is slowly but surely working towards an external RSO (Riot Sign-On) solution. Meaning, we as developers, can have users authenticate into Riot (officially) via the API. Which if all goes all, means a user could potentially give us their consent to go view their custom game data or champion mastery grades, etc.. but you would probably need consent per user to do these special calls, versus a blanket policy of letting developers go retrieve more private information.",
            "counter": 2,
            "categoryId": "%E2%84%B9"
        },
        {
            "command": "dab",
            "message": "<:dab:395941227054497792>",
            "counter": 39,
            "categoryId": "kappa:358293780107100160"
        },
        {
            "command": "devportal",
            "message": "https://developer.riotgames.com/api-methods/",
            "counter": 1,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "dont-mention-andre",
            "counter": 5,
            "message": "<:monkaS:386949081827639296>",
            "categoryId": "kappa:358293780107100160"
        },
        {
            "command": "dont-mention-azoy",
            "message": "Not necessarily a rule, but every time you mention Azoy, Swift gets a little more random, and Go gets a little bit better.",
            "counter": 25,
            "categoryId": "kappa:358293780107100160"
        },
        {
            "command": "dont-mention-rioters",
            "message": "Rule 5. Please do not mention or DM individual Rioters for help (unless advised to). Instead, ask in one of the public channels for assistance as it will get more exposure there (More 👀 will see it) and you will probably receive an answer faster.",
            "counter": 46,
            "categoryId": "TuxHammer:358298723035643905"
        },
        {
            "command": "dragontail",
            "message": "https://ddragon.leagueoflegends.com/cdn/dragontail-{ddragonVersion}.tgz",
            "counter": 51,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "esports-api",
            "counter": 4,
            "message": "The official API does not have any endpoints for esports. There is an API used by lolesports.com, but it is not officially supported and may change at any time without warning. There is some unofficial documentation here, but it might not be accurate or up-to-date https://gist.github.com/levi/e7e5e808ac0119e154ce",
            "categoryId": "%E2%84%B9"
        },
        {
            "command": "example",
            "message": "Please post an example url, without your API key.",
            "counter": 18,
            "categoryId": "TuxHammer:358298723035643905"
        },
        {
            "command": "forum",
            "message": "https://discussion.developer.riotgames.com/",
            "counter": 1,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "game-constants",
            "message": "https://developer.riotgames.com/game-constants.html",
            "counter": 1,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "good-bot",
            "message": "ty bby",
            "counter": 30,
            "categoryId": "kappa:358293780107100160"
        },
        {
            "command": "gurus",
            "message": "Community Gurus are just normal developers that Rioters have recognized as being very knowledgeable about the API and the community, as well as trustworthy. Their main purpose is to be a good and reliable source of information about the API to the community. They are empowered to moderate the forums and the discord server if the code of conduct rules are broken.\n\n\"Gurus are trustworthy, trust me\" ~ A Guru",
            "counter": 6,
            "categoryId": "%E2%84%B9"
        },
        {
            "command": "ids",
            "counter": 2,
            "message": "A summoner ID is an ID for a League of Legends account, and an account ID is an ID for a Riot Games account. Currently these 2 IDs correspond to the same thing, but this may change in the future (if Riot releases a new game, or allows you to link multiple LoL accounts together). Different APIs use different ID types, and you should use whichever type is used by the API you are using. Both ID types are only across a single region, and the same ID may exist on multiple regions.",
            "categoryId": "%E2%84%B9"
        },
        {
            "command": "jibber-jabber",
            "message": "Guidelines concerning the usage of Riot's intellectual property can be found here: https://www.riotgames.com/legal-jibber-jabber",
            "counter": 10,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "just-ask",
            "message": "If you're having an issue and need help with something, just post your problem in #troubleshooting  (don't bother asking if somebody can help you first). This should decrease the time it takes for you to get the help you need.",
            "counter": 11,
            "categoryId": "TuxHammer:358298723035643905"
        },
        {
            "command": "legal",
            "counter": 4,
            "message": "Guidelines concerning the usage of Riot's intellectual property can be found here: https://www.riotgames.com/legal-jibber-jabber",
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "libraries",
            "message": "https://discussion.developer.riotgames.com/articles/61/public-libraries-for-the-riot-games-api.html",
            "counter": 8,
            "categoryId": "%F0%9F%91%AA"
        },
        {
            "command": "libs",
            "message": "https://discussion.developer.riotgames.com/articles/61/public-libraries-for-the-riot-games-api.html",
            "counter": 45,
            "categoryId": "%F0%9F%91%AA"
        },
        {
            "command": "limits",
            "message": "https://developer.riotgames.com/rate-limiting.html",
            "counter": 3,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "login-issues",
            "counter": 2,
            "message": "If you have issues logging in to the devportal, try;\nClicking the \"signout\" button if its there\nClearing your browser's cache\nUsing an incognito/private window\nLogging in to https://na.leagueoflegends.com/en/",
            "categoryId": "%E2%84%B9"
        },
        {
            "command": "memes",
            "counter": 5,
            "message": "<https://imgur.com/a/j22Ov>",
            "categoryId": "kappa:358293780107100160"
        },
        {
            "command": "mobile-apps",
            "message": "You can create a mobile app that uses the API, but you'll need to create a webpage to explain the app, and a server to proxy your API calls. The website should contain enough information so that Rioters can evaluate your project (to ensure it isn't breaking any rules) without actually downloading it. You'll also need to setup a server to make your API calls from. You cannot securely store your API key in a distributed app, so your app will need to communicate with a server, which will in turn communicate with the API.",
            "counter": 7,
            "categoryId": "%E2%84%B9"
        },
        {
            "command": "my-apps",
            "message": "https://developer.riotgames.com/apps",
            "counter": 12,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "perks",
            "counter": 7,
            "message": "Rune list: http://ddragon.leagueoflegends.com/cdn/{ddragonVersion}/data/en_US/runesReforged.json or https://developer.riotgames.com/api-methods/#lol-static-data-v3/GET_getReforgedRunes\nRune icons: the `icon` field for each rune is relative to `https://ddragon.leagueoflegends.com/cdn/img/` (e.g. <https://ddragon.leagueoflegends.com/cdn/img/perk-images/Styles/Domination/Electrocute/Electrocute.png>)",
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "praise",
            "message": "http://riotadobo.com/\nhttp://riottux.com/\nhttp://riotgene.com/",
            "counter": 4,
            "categoryId": "kappa:358293780107100160"
        },
        {
            "command": "programming-discords",
            "message": "These are some programming help discords. Please join these for beginner help: https://discordservers.com/?term=programming",
            "counter": 3,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "rate-limit",
            "message": "https://developer.riotgames.com/rate-limiting.html",
            "counter": 4,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "rate-limiting",
            "message": "https://developer.riotgames.com/rate-limiting.html",
            "counter": 11,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "repo",
            "message": "https://github.com/Querijn/BottyMcBotface",
            "counter": 40,
            "categoryId": "%F0%9F%91%AA"
        },
        {
            "command": "rso",
            "message": "RSO is Riot Sign-On, the login logic you see whenever you access anything that requires your account. \n\nAwhile back, they stopped doing updates on RSO's timeline because its a very slow moving beast. You can think of Riot as a few dozen internal teams. They each have their own goals and can move their group in a direction that they best see fit for Riot and League of Legends. Obviously, upper management has goals and things in mind, but these groups can strive for those goals in any fashion they like, as they have that freedom.\n\nNow, the API itself is nothing more than an edge layer that exposes the internal APIs. Each endpoint you hit, is the same endpoints (more or less) that the game uses itself, the API ones are exposed to the public. The API endpoints are all managed by different internal teams. One team could control /summoner/ and another the /match/ endpoints. Meaning if the API team wanted to add a new field to all endpoints then every team would have to do this, as the internal teams control their respective API endpoints not the API team itself.\n\nNow on top of this those teams could say \"Well I know you want this but its not a priority for us right now, sorry\". And BOOM, the idea is dead.\n\nSame deal with the RSO, however, rather than adding a simple field they are now exposing private data which on top of not being a priority for some teams, it may also be something certain teams refuse to do, as they think it will be too big of a risk. If Developer Jimmy finds a flaw in the RSO API, they could start pulling actual sensitive and private data, that's a very real and scary thing, because you also use RSO to go view things like your account information and billing, etc.\n\nSo part of the battle is still in defining how they would actually go about this in a safe way, on top of making it an actual priority for every single team that would be involved with it. \n\nTLDR: RSO is a goal, but will take time due to security and priority concerns.",
            "counter": 6,
            "categoryId": "%E2%84%B9"
        },
        {
            "command": "seed-data",
            "counter": 3,
            "message": "You can find seed data for matches at these urls;\nhttps://s3-us-west-1.amazonaws.com/riot-developer-portal/seed-data/matches1.json\n...\nhttps://s3-us-west-1.amazonaws.com/riot-developer-portal/seed-data/matches10.json",
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "server-info",
            "message": "\nThis Discord server is for the Riot Games API, a tool which provides data to sites like op.gg. All Rioters here that are working officially are part of the team that manages the API, and will not be able to help you with support or gameplay issues. If you're having account related issues or technical problems, contact Riot Games support: https://support.riotgames.com/hc/en-us. If you have a game-related suggestion or feedback, post on the boards: <https://boards.na.leagueoflegends.com/en/> (make sure you change the region to the one you play on).",
            "counter": 18,
            "categoryId": "%E2%84%B9"
        },
        {
            "command": "should-i-use-a-library",
            "message": "Using a Riot API wrapper makes working with the API much easier, and is highly recommended for everyone (especially beginners). If you use a wrapper, you don't need to worry about things like rate limiting or properly formatting requests. You can find a list of wrappers here https://discussion.developer.riotgames.com/articles/61/public-libraries-for-the-riot-games-api.html",
            "counter": 13,
            "categoryId": "%E2%84%B9"
        },
        {
            "command": "static-data",
            "counter": 1,
            "message": "https://developer.riotgames.com/static-data.html",
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "swagger",
            "message": "http://www.mingweisamuel.com/riotapi-schema/tool/",
            "counter": 7,
            "categoryId": "%F0%9F%91%AA"
        },
        {
            "command": "tickets",
            "message": "https://developer.riotgames.com/support/tickets/",
            "counter": 5,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "tournament",
            "message": "https://developer.riotgames.com/tournament-api.html",
            "counter": 4,
            "categoryId": "%F0%9F%94%97"
        },
        {
            "command": "translators",
            "message": "If you'd prefer to speak to somebody in your native language, there is a list of volunteer translators pinned in #off-topic. These people can help you directly in your native language, or translate messages so somebody else can help you.",
            "categoryId": "%E2%84%B9"
        },
        {
            "command": "version",
            "counter": 16,
            "message": "**DDragon**: You can find the available versions here: http://ddragon.leagueoflegends.com/api/versions.json. The current version is {ddragonVersion}.\n**Game**: The game is currently at version {gameVersion}.",
            "categoryId": "%E2%84%B9"
        }
    ]
}